Библиотека/src/InformationRegisters/КаталогКниг/КаталогКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КаталогКниг</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Автор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Издательство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ISBN</name>
    <comment>Строка в формате с дефисами</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ISBNЧисло</name>
    <comment>Строка без дефисов для поиска</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ГодИздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаСайт</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаКартинку</name>
    <comment>Ссылка на картинку</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторКниги</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Библиотека/src/Documents/ПоступлениеКниг/ПоступлениеКниг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеКниг</name>
  <registerRecords>AccumulationRegister.КнигиВБиблиотеке</registerRecords>
  <attributes>
    <name>Комментарии</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.Книги</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека/src/Catalogs/Книги/Книги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Книги</name>
  <attributes>
    <name>Страниц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Издательство</name>
    <type>
      <types>CatalogRef.Издательства</types>
    </type>
  </attributes>
  <attributes>
    <name>ISBN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИнвентарныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяКомпактДиск</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ББК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УДК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Диск</name>
    <type>
      <types>CatalogRef.Диски</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодИздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тираж</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обложка</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Авторы</name>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Авторы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Библиотека/src/InformationRegisters/КаталогКниг/Forms/ИмпортКниги/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получим данные по книге
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КаталогКниг.Наименование КАК Наименование,
		|	КаталогКниг.Описание КАК Описание,
		|	КаталогКниг.Автор КАК Автор,
		|	КаталогКниг.Издательство КАК Издательство,
		|	КаталогКниг.ISBN КАК ISBN,
		|	КаталогКниг.ГодИздания КАК ГодИздания,
		|	КаталогКниг.СсылкаНаКартинку КАК СсылкаНаКартинку
		|ИЗ
		|	РегистрСведений.КаталогКниг КАК КаталогКниг
		|ГДЕ
		|	КаталогКниг.ИдентификаторКниги = &ИдентификаторКниги";
	
	Запрос.УстановитьПараметр("ИдентификаторКниги", Параметры.ИдентификаторКниги);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
		// Попробуем найти авторов в справочнике авторов
	Авторы = СтрРазделить(Автор, ";,", Ложь);
	Для Каждого Строка Из Авторы Цикл
		НоваяСтрока = АвторыСписокСтрок.Добавить();
		НоваяСтрока.Значение = Строка;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Авторы.Ссылка КАК Автор
		|ИЗ
		|	Справочник.Авторы КАК Авторы
		|ГДЕ
		|	Авторы.Наименование В(&Авторы)";
	
	Запрос.УстановитьПараметр("Авторы", Авторы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = АвторыСписокСсылок.Добавить();
		НоваяСтрока.Значение = ВыборкаДетальныеЗаписи.Автор;
	КонецЦикла;
	
	Если АвторыСписокСсылок.Количество() = 0 Тогда
		ВариантСозданияАвторов = "Создать";
	Иначе
		ВариантСозданияАвторов = "Выбрать";
	КонецЕсли;
	
	// Попробуем найти издательство в справочнике по наименованию
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Издательства.Ссылка КАК Издательство
		|ИЗ
		|	Справочник.Издательства КАК Издательства
		|ГДЕ
		|	Издательства.Наименование = &НаименованиеИздательства";
	
	Запрос.УстановитьПараметр("НаименованиеИздательства", Издательство);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИздательствоСсылка = ВыборкаДетальныеЗаписи.Издательство;
	КонецЦикла;
	
	Если ИздательствоСсылка.Пустая() Тогда
		ВариантСозданияИздательства = "Создать";
	Иначе
		ВариантСозданияИздательства = "Выбрать";
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВариантСозданияАвторовПриИзменении(Неопределено);
	ВариантСозданияИздательстваПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСозданияАвторовПриИзменении(Элемент)
	
	Если ВариантСозданияАвторов = "Создать" Тогда
		Элементы.АвторыСписокСсылок.Видимость = Ложь;
		Элементы.АвторыСписокСтрок.Видимость = Истина;
	ИначеЕсли ВариантСозданияАвторов = "Выбрать" Тогда
		Элементы.АвторыСписокСсылок.Видимость = Истина;
		Элементы.АвторыСписокСтрок.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантСозданияИздательстваПриИзменении(Элемент)
	
	Если ВариантСозданияИздательства = "Создать" Тогда
		Элементы.ИздательствоСсылка.Видимость = Ложь;
		Элементы.Издательство.Видимость = Истина;
	ИначеЕсли ВариантСозданияИздательства = "Выбрать" Тогда
		Элементы.ИздательствоСсылка.Видимость = Истина;
		Элементы.Издательство.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьИмпортНаСервере()
	
	НачатьТранзакцию();
	
	// Сначала создадим файл обложки
	Файл = Неопределено;
	Если ЗначениеЗаполнено(СсылкаНаКартинку) Тогда
		ИмяВременногФайла = ОбщегоНазначения.ЗагрузитьФайлПоСсылке(СсылкаНаКартинку, ".jpg");
		ФайлНаДиске = Новый Файл(ИмяВременногФайла);
		Если ФайлНаДиске.Существует() Тогда
			КороткоеИмяФайла = РаботаСФайламиКлиентСервер.КороткоеИмяФайлаИзПолногоПути(ИмяВременногФайла);
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногФайла);
			АдресВХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
			Файл = РаботаСФайламиВызовСервера.ЗагрузитьФайл(АдресВХранилище, КороткоеИмяФайла);
		КонецЕсли;
	КонецЕсли;
	
	// Теперь создадим книгу
	ИздательствоДляСозданияКниги = Неопределено;
	Если ВариантСозданияИздательства = "Создать" Тогда
		Если ЗначениеЗаполнено(Издательство) Тогда
			ИздательствоДляСозданияКниги = Справочники.Издательства.СоздатьИздательство(Издательство);
			ИздательствоСсылка = ИздательствоДляСозданияКниги;
		КонецЕсли;
	ИначеЕсли ВариантСозданияИздательства = "Выбрать" Тогда
		ИздательствоДляСозданияКниги = ИздательствоСсылка;
	КонецЕсли;
	
	АвторыДляСозданияКниги = Новый Массив;
	Если ВариантСозданияАвторов = "Создать" Тогда
		Для Каждого Строка Из АвторыСписокСтрок Цикл
			Если ЗначениеЗаполнено(Строка.Значение) Тогда
				АвторыДляСозданияКниги.Добавить(Справочники.Авторы.СоздатьАвтора(Строка.Значение));
			КонецЕсли;
		КонецЦикла;
		АвторыСписокСсылок.ЗагрузитьЗначения(АвторыДляСозданияКниги);
	ИначеЕсли ВариантСозданияАвторов = "Выбрать" Тогда
		АвторыДляСозданияКниги = АвторыСписокСсылок.ВыгрузитьЗначения();
	КонецЕсли;
	
	Книга = Справочники.Книги.СоздатьКнигу(
			Наименование,
			Наименование,
			Описание,
			АвторыДляСозданияКниги,
			ИздательствоДляСозданияКниги,
			0,
			ГодИздания,
			"",
			ISBN,
			"",
			Штрихкод,
			Файл);
	
	// Сделаем поступлении книги в библиотеку
	ДокументПоступления = Документы.ПоступлениеКниг.СоздатьДокумент();
	ДокументПоступления.Дата = ТекущаяДата();
	НоваяСтрока = ДокументПоступления.Книги.Добавить();
	НоваяСтрока.Книга = Книга;
	ДокументПоступления.Комментарии = "Импорт книги из каталога книг";
	Попытка
		ДокументПоступления.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Не удалось создать документ поступления книг";
		СообщениеПользователю.Сообщить();
		ОбщегоНазначения.ЗафиксироватьОшибку(СообщениеПользователю.Текст, ОписаниеОшибки, Метаданные.Документы.ПоступлениеКниг, Наименование);
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьИмпорт(Команда)
	
	ЗавершитьИмпортНаСервере();
	ПоказатьЗначение( , Книга);
	
КонецПроцедуры
